app/controllers/books_controller.rb

  def create
  	 @book = Book.new(book_params)
     @book.user_id = current_user.id
     if @book.save
---
INSERT INTO "books" ("created_at", "updated_at", "title", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2019-05-25 06:09:50.901249"], ["updated_at", "2019-05-25 06:09:50.901249"], ["title", "yyy"], ["body", "yyyy"], ["user_id", 13]]

  def update
    book = Book.find(params[:id])
    if book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "xxxxxxss"], ["updated_at", "2019-05-23 12:51:07.907967"], ["id", 25]]

  def correct_user
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]