app/controllers/users_controller.rb

	def update
		user = User.find(params[:id])
		if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "888888"], ["profile_image_id", "b20a6e60bfd25cb7fc93a2f7045d386a4bf1a0dd4d136675a9625e08acfd"], ["updated_at", "2019-05-22 12:30:33.330679"], ["id", 5]]